#Задача. Составить список из первых пяти город миллионников. Напечатать первый и последений город из этого списка.
list_cities = ['Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань']
print(f"Первый город из списка: {list_cities[0]}") #вызовет 1 город из списка
print(f"Последний город из списка: {list_cities[-1]}") #вызовет последний город из списка